"""Создать словарь цветов, в котором ключ - название или кодировка цвета; значение - кортеж из rgb этого цвета."""

d={'Crimson':(220,20,60), 'HotPink':(255,105,180), 'Coral':(255,127,80), 'Khaki':(240,230,140), 
   'SlateBlue':(106,90,205), 'SkyBlue':(135,206,235), 'Lime':(0,255,0)}
print(d)
